{
  "id": "38",
  "name": "מנמ\"א ממ\"ן 14 שאלה 2",
  "body": "### סעיף א'\nהבעיה העקרונית באלגוריתם הנתון היא שהוא מניח שפונקציית הגיבוב $h$ היא מונוטונית: תנאי הכרחי ומספיק לנכונות האלגוריתם היא שכשנשרשר את התאים $T[0],...,T[m-1]$ אחד לשני נקבל מערך ממוין, או באופן שקול שבהינתן $i\\lt j$, כל האיברים בתא $T[j]$ גדולים מכל האיברים בתא $T[i]$. החלוקה לתאים נעשית לפי הערך של פונקציית הגיבוב $h$, כלומר התנאי האמור שקול לכך שלכל $x,y$ כך ש-$h(x)=i,h(y)=j$, בהכרח $x\\lt y$; תנאי זה בתורו שקול לכך ש-$x\\ge y$ גורר ש-$h(x)\\ge h(y)$, כלומר ש-$h$ מונוטונית.\nאבל, ההנחות על טבלת הגיבוב כלליות מדי מכדי להבטיח מונוטוניות: כדוגמה קונקרטית ניקח את $U$ להיות תחום המספרים הטבעיים, $h(x)=x\\bmod m$ ונניח שמכניסים לטבלה את $n=m+1$ המספרים $0,1,...,m$: אז $h(0)=h(m)=0$, לכן בתא ה-$0$ יהיו זוג האיברים $\\set{0,m}$, ולכל $i$ אחר בתא ה-$i$ יהיה רק $\\set{i}$. בתום המיון נקבל את המערך $[0,m,1,2,...,m-1]$ – והמיון כשל. כאמור, שורש הבעיה הוא ש-$h$ לא מונוטונית, ובמקרה הקיצוני הנתון האיבר הגדול ביותר הוכנס לתא הקטן ביותר. $\\square$\n\n### סעיף ב'\nנדרש לנתח את תוחלת זמן הריצה של האלגוריתם כפונקציה של $m$ ו-$n$, וכן את זמן הריצה במקרה הגרוע. נפרק את זמן הריצה לפי השלבים:\n1. הכנסה לטבלת גיבוב רצה בזמן $\\Theta(1)$ תמיד, לכן הצעד הראשון (שבו $n$ האיברים מוכנסים לטבלה) אורך $\\Theta(n)$.\n2. הגיבוב הוא אחיד ופשוט, ולכן תוחלת מספר האיברים שנמצאים בכל תא אחרי השלב הראשון היא $n/m$. יתר על כן, בשל העובדה שהאיברים בלתי תלויים זה בזה ושווי התפלגות, התפלגות האיברים שנמצאים בכל תא אחרי ההכנסה היא אחידה, במובן הבא: בהינתן שיש בתא כלשהו $k$ איברים, לכל יחסי הסדר האפשריים ביניהם יש אותה הסתברות להופיע (אם היינו מניחים שאלו איברים שונים, הכוונה הייתה שלכל התמורות שלהם אותה הסתברות להופיע, אלא שייתכנו חזרות ולכן אלה לא בדיוק תמורות). הנחה זו מאפשרת לנו להשתמש בתוצאות מהספר על ביצועי המיון המהיר במקרה הממוצע – דהיינו, תוחלת זמן הריצה של המיון של תא מסוים, בהינתן שיש בו $k$ איברים, היא $\\Theta(k\\log k)$. \nכעת נפריד למקרים: כש-$n=m$, תוחלת מספר האיברים בתא היא $n/m=1$, ולכן תוחלת זמן הריצה של המיון המהיר של תא אחד היא $\\Theta(1)$; יש $m$ תאים, ולכן השלב לוקח $\\Theta(m)$ צעדים בממוצע.\nכש-$n\\gt m$, תוחלת מספר האיברים בכל תא היא $n/m\\gt 1$, ולכן תוחלת זמן הריצה של מיון מהיר בתא אחד היא $(n/m)\\log(n/m)$; מלינאריות התוחלת נקבל שתוחלת זמן הריצה של השלב כולו היא $\\Theta(n\\log(n/m))$. \n3. אנחנו מניחים שהרשימות המקושרות שנמצאות בכל תא הן דו-כיווניות, ולכן שרשור של שתי רשימות אורך $\\Theta(1)$ (שכן צריך רק להוסיף את ראש הרשימה השנייה אחרי הזנב של הראשונה). יש $m$ רשימות סה\"כ, לכן שרשור כל הרשימות אורך $\\Theta(m)$. לחילופין, אפשר גם להעתיק את הרשימות המקושרות בזו אחר זו לתוך מערך (המערך המקורי או אחד חדש), ובשל העובדה שיש $n$ איברים זה אורך $\\Theta(n)$. אבל כמו שראינו הצעד הראשון ממילא לוקח $\\Theta(n)$ ו-$n\\ge m$, לכן זה לא משנה את זמן הריצה האסימפטוטמי של האלגוריתם.\n\nיחד נקבל שתוחלת זמן הריצה של האלגוריתם היא\n$$\\begin{cases}\n\\Theta(n) & n=m \\\\\n\\Theta(n\\log(n/m)) & n\\gt m\n\\end{cases}$$\nבמקרה הגרוע ביותר, כל האיברים ברשימה מוכנסים לאותו תא בטבלת הגיבוב, וגם הדגימות האקראיות שמתבצעות במהלך המיון המהיר מניבות את הביצועים הגרועים ביותר. זמן הריצה של ההכנסה ושל השרשור לא משתנים במקרה הזה, אבל המיון המהיר ייקח $\\Theta(n^2)$ בתא שבו נמצאים כל האיברים (ו-$\\Theta(1)$ בכל שאר התאים, שהם ריקים), לכן סיבוכיות הזמן במקרה הגרוע היא $\\Theta(n^2)$. $\\square$\n\n### סעיף ג'\nנתון ש-$n$ המספרים מתפלגים באופן אחיד בתחום $U=[0,...,n^3-1]$, ונדרש למצוא פונקציית גיבוב $h$ וערך ל-$m$ שעבורו האלגוריתם הנתון יהיה אלגוריתם מיון תקין, עם תוחלת זמן ריצה $O(n)$.\nניקח $m=n$ ואת פונקציית הגיבוב\n$$h(x):=\\floor{\\frac{x}{n^2}}$$\nהתחום הנתון $U$ הוא בדיוק אוסף המספרים $x$ שעבורם $0\\le h(x)\\lt n$, ולכן $h$ מתאימה לערך שבחרנו עבור $m$. בנוסף, \n$$h^{-1}(a)=[an^2,...,(a+1)n^2-1]$$\nובפרט $\\left|h^{-1}(a)\\right|=n^2=n^3/n$, כלומר מספר הערכים שיוכנסו לתא ה-$a$ זהה עבור כל $0\\le a\\lt n$; יחד עם ההנחה שהמספרים מתפלגים באופן אחיד ב-$U$, נקבל ש-$h$ אכן נותנת גיבוב אחיד ופשוט מ-$U$ ל-$[0,...,n-1]$. בנוסף, $h$ מונוטונית עולה, ומסעיף א' זה תנאי הכרחי ומספיק לנכונות האלגוריתם, כלומר הוא אכן ימיין בהצלחה. לבסוף, כאן $m=n$, ומהאמור בסעיף הקודם תוחלת זמן הריצה של האלגוריתם היא $\\Theta(n)$, כנדרש.\nאין באמור בסעיף זה סתירה לאמור בסעיף א' – שם ראינו שההנחות על טבלת הגיבוב כלליות מדי מכדי להבטיח את המונוטיות של פונקציית הגיבוב $h$, אבל זה כמובן לא אומר שבמקרים ספציפיים, כמו המקרה הנתון פה, לא נוכל למצוא פונקציית גיבוב מונוטונית מתאימה. $\\square$"
}